ᱫᱤᱥᱚᱢ = [[('Finland', 'Helsinki')], [('Sweden', 'Stockholm')], [('Norway', 'Oslo')]]
ᱞᱟᱜᱮ ᱟᱛᱩᱫᱤᱥᱚᱢ in ᱫᱤᱥᱚᱢ:
    ᱚᱞ(ᱟᱛᱩᱫᱤᱥᱚᱢ)


######################################################################


ᱫᱤᱥᱚᱢ = [[('Finland', 'Helsinki')], [('Sweden', 'Stockholm')], [('Norway', 'Oslo')]]
ᱞᱟᱜᱮ ᱟᱛᱩᱫᱤᱥᱚᱢ in ᱫᱤᱥᱚᱢ:
    ᱚᱞ(ᱟᱛᱩᱫᱤᱥᱚᱢ)


ᱫᱤᱥᱚᱢ_ᱞᱤᱥᱴ = list(ᱱᱟᱠᱥᱟ(lambda x: '-'.join(x[0]), ᱫᱤᱥᱚᱢ))
ᱚᱞ(ᱫᱤᱥᱚᱢ_ᱞᱤᱥᱴ)



##############################################################################

ᱮᱮᱞ = [-4, -3, -2, -1, 0, 2, 4, 6]
ᱞᱟᱜᱮ ᱮᱞ in ᱮᱮᱞ:
    ᱚᱞ(ᱮᱞ)

ᱮᱞ_ᱞᱤᱥᱛ = list(ᱱᱟᱠᱥᱟ(ᱤᱱᱛ, ᱮᱮᱞ))
ᱚᱞ(ᱮᱞ_ᱞᱤᱥᱛ)





