ᱮᱞ = [-4, -3, -2, -1, 0, 2, 4, 6]
ᱵᱟᱫᱤᱥᱮ_ᱮᱞ = [n for n in ᱮᱞ if n < 0]
ᱚᱞ(ᱵᱟᱫᱤᱥᱮ_ᱮᱞ)


###########################################################


ᱞᱤᱥᱛ_ᱨᱮᱱᱟ_ᱞᱤᱥᱛ = [[[1, 2, 3]], [[4, 5, 6]], [[7, 8, 9]]]
ᱝᱞᱟᱴᱮᱱᱫ_ᱞᱤᱥᱛ = [n ᱞᱟᱜᱮ ᱥᱤᱫᱦᱟ in ᱞᱤᱥᱛ_ᱨᱮᱱᱟ_ᱞᱤᱥᱛ ᱞᱟᱜᱮ ᱠᱦᱟᱱᱫᱨᱤᱱ in ᱥᱤᱫᱦᱟ ᱞᱟᱜᱮ n in ᱠᱦᱟᱱᱫᱨᱤᱱ]
ᱚᱞ(ᱝᱞᱟᱴᱮᱱᱫ_ᱞᱤᱥᱛ)


############################################################


ᱨᱮᱥᱩᱞᱛ = [(n, 1, n, n*n, n*n*n, n*n*n*n, n*n*n*n*n) ᱞᱟᱜᱮ n in ᱡᱦᱟᱞ(0, 11)]
ᱚᱞ(ᱨᱮᱥᱩᱞᱛ)


#######################################################################################


ᱫᱤᱥᱚᱢ = [[('Finland', 'Helsinki')], [('Sweden', 'Stockholm')], [('Norway', 'Oslo')]]
ᱫᱤᱥᱚᱢ_ᱱᱩᱛᱩᱢ = [ᱫᱤᱥᱚᱢ.upper() ᱞᱟᱜᱮ ᱥᱤᱫᱦᱟ in ᱫᱤᱥᱚᱢ ᱞᱟᱜᱮ ᱛᱩᱯ in ᱥᱤᱫᱦᱟ ᱞᱟᱜᱮ ᱫᱤᱥᱚᱢ in ᱛᱩᱯ]
ᱚᱞ(ᱫᱤᱥᱚᱢ_ᱱᱩᱛᱩᱢ)


##########################################################################################


def m(x1, y1, x2, y2):
    ᱨᱩᱟᱨ (y2 - y1) / (x2 - x1)

ᱚᱞ(m(2, 2, 4, 8))


#######################################################################################


ᱫᱤᱥᱚᱢ = [[('Finland', 'Helsinki')], [('Sweden', 'Stockholm')], [('Norway', 'Oslo')]]
ᱛᱩᱯ = [ᱛᱩᱯ ᱞᱟᱜᱮ ᱥᱤᱫᱦᱟ in ᱫᱤᱥᱚᱢ ᱞᱟᱜᱮ ᱛᱩᱯ in ᱥᱤᱫᱦᱟ]
ᱞᱥᱛ = []
ᱞᱟᱜᱮ i in ᱛᱩᱯ:
    d = {}
    d['country'] = i[0]
    d['city'] = i[1]
    ᱞᱥᱛ.append(d)
ᱚᱞ(ᱞᱥᱛ)
