ᱞᱟᱜᱮ ᱮᱞ in ᱡᱦᱟᱞ(11):
    ᱚᱞ(ᱮᱞ)

ᱞᱮᱠᱦᱟ = 0
while ᱞᱮᱠᱦᱟ <= 10:
    ᱚᱞ(ᱞᱮᱠᱦᱟ)
    ᱞᱮᱠᱦᱟ += 1
    



##################################################


ᱞᱟᱜᱮ ᱮᱞ in ᱡᱦᱟᱞ(10, -1, -1):
    ᱚᱞ(ᱮᱞ)

ᱞᱮᱠᱦᱟ = 10
while ᱞᱮᱠᱦᱟ >= 0:
    ᱚᱞ(ᱞᱮᱠᱦᱟ)
    ᱞᱮᱠᱦᱟ -= 1


##########################################################


num = ᱤᱱᱛ(ᱤᱱᱯᱩᱛ("Which table's number: "))
ᱞᱟᱜᱮ number in ᱡᱦᱟᱞ(11):
    ᱚᱞ(f"{number} x {num} = {number * num}")


# 0 x 3 = 0
# 1 x 3 = 3
# 2 x 3 = 6
# 3 x 3 = 9
# 4 x 3 = 12
# 5 x 3 = 15
# 6 x 3 = 18
# 7 x 3 = 21
# 8 x 3 = 24
# 9 x 3 = 27
# 10 x 3 = 30

############################################################################


ᱞᱟᱜᱮ ᱮᱞ in ᱡᱦᱟᱞ(101):
    ᱡᱩᱫᱤ ᱮᱞ % 2 == 0:
        ᱚᱞ(ᱮᱞ)


###################################################################################

ᱞᱟᱜᱮ ᱮᱞ in ᱡᱦᱟᱞ(101):
    ᱡᱩᱫᱤ ᱮᱞ % 2 != 0:
        ᱚᱞ(ᱮᱞ)

###############################################################################

ᱮᱞ = ᱤᱱᱛ(ᱤᱱᱯᱩᱛ("Enter the number: "))
ᱡᱚᱛᱚ_ᱥᱮᱞᱮᱫ = sum(ᱡᱦᱟᱞ(1, ᱮᱞ + 1))
ᱚᱞ(ᱡᱚᱛᱚ_ᱥᱮᱞᱮᱫ)


