ᱚᱞ( 1 + 2)
ᱚᱞ( 2 - 1)
ᱚᱞ( 2 * 3)
ᱚᱞ ( 4 / 2)                         # Division in python gives floating number
ᱚᱞ( 6 / 2)
ᱚᱞ( 7 / 2)
ᱚᱞ( 7 // 2)   # gives without the floating number or without the remaining
ᱚᱞ( 3 % 2)                           # Gives the remainder
ᱚᱞ ( 7 // 3)
ᱚᱞ( 3 ** 2)   



#############################################################



ᱨᱟᱫᱤᱩᱥ = 10                                 
ᱴᱷᱟᱶ_ᱤᱯᱤᱞ_ᱜᱩᱞᱟᱹᱭ = 3.14 * ᱨᱟᱫᱤᱩᱥ ** 2         
ᱚᱞ( ᱴᱷᱟᱶ_ᱤᱯᱤᱞ_ᱜᱩᱞᱟᱹᱭ)


################################


ᱡᱮᱞᱮᱱᱜ = 10
ᱟᱥᱟᱨ = 20
area_of_rectangle = ᱡᱮᱞᱮᱱᱜ * ᱟᱥᱟᱨ
ᱚᱞ(area_of_rectangle)


########################################################


ᱢᱟᱥ = 75
ᱜᱨᱟᱶᱤᱛᱭ = 91
ᱟᱩᱡᱚᱱ = ᱢᱟᱥ * ᱜᱨᱟᱶᱤᱛᱭ
ᱚᱞ(ᱟᱩᱡᱚᱱ)