def ᱚᱞ_ᱛᱮᱱᱠᱚᱱᱟ(n):
    ᱞᱟᱜᱮ i in ᱡᱦᱟᱞ(n):
        ᱞᱟᱜᱮ j in ᱡᱦᱟᱞ(i + 1):
            ᱚᱞ("*", end=" ")
        ᱚᱞ()

# Example usage
ᱚᱞ_ᱛᱮᱱᱠᱚᱱᱟ(16)


####################################################

def ᱚᱞ_ᱦᱮᱨᱟ(n):
    ᱞᱟᱜᱮ i in ᱡᱦᱟᱞ(n):
        ᱚᱞ(" " * (n - i - 1) + "* " * (i + 1))
    ᱞᱟᱜᱮ i in ᱡᱦᱟᱞ(n - 1, 0, -1):
        ᱚᱞ(" " * (n - i) + "* " * i)

# Example usage
ᱚᱞ_ᱦᱮᱨᱟ(5)



#######################################################

def ᱚᱞ_ᱪᱦᱟᱨᱠᱚᱱᱟ(n):
    ᱞᱟᱜᱮ i in ᱡᱦᱟᱞ(n):
        ᱞᱟᱜᱮ j in ᱡᱦᱟᱞ(n):
            ᱚᱞ("*", end=" ")
        ᱚᱞ()

# Example usage
ᱚᱞ_ᱪᱦᱟᱨᱠᱚᱱᱟ(5)



###########################################################


def ᱚᱞ_ᱯᱭᱨᱟᱢᱤᱫ(n):
    ᱞᱟᱜᱮ i in ᱡᱦᱟᱞ(n):
        ᱚᱞ(" " * (n - i - 1) + "*" * (2 * i + 1))
        
# Example usage
ᱚᱞ_ᱯᱭᱨᱟᱢᱤᱫ(5)



####################################################

